# NumericRevisionSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumericRevisionSettings Methods
NumericRevisionSettings Class See Also
---
The NumericRevisionSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Determines whether a specified NumericRevisionSettings is the same as 'this'. |
| IsValid | Determines whether the NumericRevisionSettings object is in a valid state. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace